# Pandas Practice

This notebook is dedicated to practicing different tasks with pandas.
It should be noted there may be more than one different way to answer a question or complete an exercise.

Different tasks will be detailed by comments or text.

For further reference and resources, it's advised to check out the [pandas documentation](https://pandas.pydata.org/pandas-docs/stable/).

In [4]:
# Import pandas
import pandas as pd

In [5]:
# Create a series of three different colours
colors = pd.Series(["yello","blue","green"],name="colors")

In [6]:
# View the series of different colours
colors

0    yello
1     blue
2    green
Name: colors, dtype: object

In [7]:
# Create a series of three different car types and view it
cars = pd.Series(["audi", "mercedes","ferari"],name="cars")
cars

0        audi
1    mercedes
2      ferari
Name: cars, dtype: object

In [8]:
colors + cars

0       yelloaudi
1    bluemercedes
2     greenferari
dtype: object

In [9]:
# Combine the Series of cars and colours into a DataFrame
pd.DataFrame([colors,cars])

            0         1       2
colors  yello      blue   green
cars     audi  mercedes  ferari

In [10]:
pd.DataFrame({"colors":colors, "cars":cars})

  colors      cars
0  yello      audi
1   blue  mercedes
2  green    ferari

In [55]:
# Import "https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/car-sales.csv" and turn it into a DataFrame
raw_url =  "https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/car-sales.csv"
df = pd.read_csv(raw_url)
df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

**Note:** Since you've imported `../data/car-sales.csv` as a DataFrame, we'll now refer to this DataFrame as 'the car sales DataFrame'.

In [56]:
# Export the DataFrame you created to a .csv file
df.to_csv("car_sales.csv")

In [57]:
# Find the different datatypes of the car data DataFrame
df.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [58]:
# Describe your current car sales DataFrame using describe()
df.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [59]:
# Get information about your DataFrame using info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

What does it show you?

In [62]:
# Create a Series of different numbers and find the mean of them
numbers = pd.Series([1,2,8,9,17,93,34,90,23,45])
numbers.mean()

32.2

In [63]:
# Create a Series of different numbers and find the sum of them
numbers.sum()

322

In [65]:
# List out all the column names of the car sales DataFrame
for item in df.columns:
    print(item)

Make
Colour
Odometer (KM)
Doors
Price

In [69]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [68]:
# Find the length of the car sales DataFrame
len(df.index)

10

In [70]:
# Show the first 5 rows of the car sales DataFrame
df.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [71]:
# Show the first 7 rows of the car sales DataFrame
df.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [72]:
# Show the bottom 5 rows of the car sales DataFrame
df.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [73]:
# Use .loc to select the row at index 3 of the car sales DataFrame
df.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [74]:
# Use .iloc to select the row at position 3 of the car sales DataFrame
df.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

Notice how they're the same? Why do you think this is? 

Check the pandas documentation for [.loc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html) and [.iloc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html). Think about a different situation each could be used for and try them out.

In [76]:
# Select the "Odometer (KM)" column from the car sales DataFrame
odo = df["Odometer (KM)"]
odo

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [77]:
# Find the mean of the "Odometer (KM)" column in the car sales DataFrame
odo.mean()

78601.4

In [79]:
df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [78]:
# Select the rows with over 100,000 kilometers on the Odometer
df[df["Odometer (KM)"] > 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [85]:
# Create a crosstab of the Make and Doors columns
df[["Make", "Doors"]]

     Make  Doors
0  Toyota      4
1   Honda      4
2  Toyota      3
3     BMW      5
4  Nissan      4
5  Toyota      4
6   Honda      4
7   Honda      4
8  Toyota      4
9  Nissan      4

In [88]:
# Group columns of the car sales DataFrame by the Make column and find the average
df.groupby("Make").mean()

/tmp/ipykernel_13728/3222898195.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Make").mean()

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

In [30]:
# Import Matplotlib and create a plot of the Odometer column
# Don't forget to use %matplotlib inline

In [31]:
# Create a histogram of the Odometer column using hist()

In [32]:
# Try to plot the Price column using plot()

Why didn't it work? Can you think of a solution?

You might want to search for "how to convert a pandas string column to numbers".

And if you're still stuck, check out this [Stack Overflow question and answer on turning a price column into integers](https://stackoverflow.com/questions/44469313/price-column-object-to-int-in-pandas).

See how you can provide the example code there to the problem here.

In [89]:
df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [92]:
df.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [93]:
df["Price"].str.replace(",", "")

0     $4000.00
1     $5000.00
2     $7000.00
3    $22000.00
4     $3500.00
5     $4500.00
6     $7500.00
7     $7000.00
8     $6250.00
9     $9700.00
Name: Price, dtype: object

In [91]:
# Remove the punctuation from price column
df[]

0     $4,000.00
1     $5,000.00
2     $7,000.00
3    $22,000.00
4     $3,500.00
5     $4,500.00
6     $7,500.00
7     $7,000.00
8     $6,250.00
9     $9,700.00
Name: Price, dtype: object

In [34]:
# Check the changes to the price column

In [35]:
# Remove the two extra zeros at the end of the price column

In [36]:
# Check the changes to the Price column

In [37]:
# Change the datatype of the Price column to integers

In [38]:
# Lower the strings of the Make column

If you check the car sales DataFrame, you'll notice the Make column hasn't been lowered.

How could you make these changes permanent?

Try it out.

In [39]:
# Make lowering the case of the Make column permanent

In [40]:
# Check the car sales DataFrame

Notice how the Make column stays lowered after reassigning.

Now let's deal with missing data.

In [41]:
# Import the car sales DataFrame with missing data ("../data/car-sales-missing-data.csv")


# Check out the new DataFrame

Notice the missing values are represented as `NaN` in pandas DataFrames.

Let's try fill them.

In [42]:
# Fill the Odometer column missing values with the mean of the column inplace

In [43]:
# View the car sales missing DataFrame and verify the changes

In [44]:
# Remove the rest of the missing data inplace

In [45]:
# Verify the missing values are removed by viewing the DataFrame

We'll now start to add columns to our DataFrame.

In [46]:
# Create a "Seats" column where every row has a value of 5

In [47]:
# Create a column called "Engine Size" with random values between 1.3 and 4.5
# Remember: If you're doing it from a Python list, the list has to be the same length
# as the DataFrame

In [48]:
# Create a column which represents the price of a car per kilometer
# Then view the DataFrame

In [49]:
# Remove the last column you added using .drop()

In [50]:
# Shuffle the DataFrame using sample() with the frac parameter set to 1
# Save the the shuffled DataFrame to a new variable

Notice how the index numbers get moved around. The [`sample()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html) function is a great way to get random samples from your DataFrame. It's also another great way to shuffle the rows by setting `frac=1`.

In [51]:
# Reset the indexes of the shuffled DataFrame

Notice the index numbers have been changed to have order (start from 0).

In [52]:
# Change the Odometer values from kilometers to miles using a Lambda function
# Then view the DataFrame

In [53]:
# Change the title of the Odometer (KM) to represent miles instead of kilometers

## Extensions

For more exercises, check out the pandas documentation, particularly the [10-minutes to pandas section](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html). 

One great exercise would be to retype out the entire section into a Jupyter Notebook of your own.

Get hands-on with the code and see what it does.

The next place you should check out are the [top questions and answers on Stack Overflow for pandas](https://stackoverflow.com/questions/tagged/pandas?sort=MostVotes&edited=true). Often, these contain some of the most useful and common pandas functions. Be sure to play around with the different filters!

Finally, always remember, the best way to learn something new to is try it. Make mistakes. Ask questions, get things wrong, take note of the things you do most often. And don't worry if you keep making the same mistake, pandas has many ways to do the same thing and is a big library. So it'll likely take a while before you get the hang of it.